// Testing Pure Functions

// 💣 этот туду можно удалить (он нужен, чтобы тесты не упали с ошибкой о пустых тестах)
test.todo('remove me')

// 🐨 испортируй функцию, которую надо протестировать
// 💰 import {isPasswordAllowed} from '../auth'

// 🐨 напиши тесты для валидных и невалидных паролей
// 💰 вот несколько паролей, которые можно проверить:
//
// валидный:
// - !aBc123
//
// невалидные:
// - a2c! // слишком короткий
// - 123456! // нет букв
// - ABCdef! // нет цифр
// - abc123! // нет заглавных
// - ABC123! // нет строчных
// - ABCdef123 // нет знаков
